{
  "posts": 
  [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    },
    {
      "id": 3,
      "Title": "adads",
      "Schwierigkeit": 5,
      "Bewertung": 10,
      "Zutaten": "asd",
      "Dauer": "domas"
    }
  ],
  "comments": 
  [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "soups": 
  [
    {
      "id": 1,
      "Title": "20-Min-Thai-Suppe",
      "Schwierigkeit": "Schwierigkeit: 4",
      "Bewertung": "Bewertung: 9.5",
      "Zutaten": "Zutaten: 2 Knoblauchzehen, 2 cm Ingwer, 2 EL Kokosöl oder neutrales Öl, 2 EL Rote Currypaste, 350 g Hähncheninnenfilet, 1,2 L kochende Gemüsebrühe, 400 ml Kokosmilch, 4 EL Sojasauce, etwas Fischsauce, 100 g Glasnudeln, Handvoll Korianderisse",
      "Dauer": "Dauer: ca. 20 Minuten",
      "Beschreibung": "Beschreibung: Knoblauch und Ingwer schälen und fein hacken. Kokosöl in einem großen Topf erhitzen und Knoblauch, Ingwer und Currypaste für ein paar Minuten bei mittlerer Hitze garen. Hähnchenfleisch in mundgerechte Stücke schneiden. In den Topf geben und braten, bis es von allen Seiten hell und nicht mehr glasig ist. Mit Gemüsebrühe und Kokosmilch ablöschen. Mit Sojasauce und Fischsauce nach Geschmack abschmecken. Glasnudeln hinzufügen und 2-3 Minuten weich werden lassen. Koriander hacken und mit der Suppe genießen."
    },
    {
      "id": 2,
      "Title": "Hühnersuppe",
      "Schwierigkeit": "Schwierigkeit: 3",
      "Bewertung": "Bewerten: 6,5",
      "Zutaten": "Zutaten: 1 Suppenhuhn (oder Hühnerteile), 1 Bund Suppengrün, 1 Bund Petersilie, 2 Gewürznelken, 1 Lorbeerblatt, 3 Pfefferkörner, 1 TL Salz",
      "Dauer": "Dauer: ca. 60 Minuten",
      "Beschreibung": "Beschreibung: Das Suppenhuhn sowie das Suppengemüse und die Kräuter waschen. Damit das Huhn besser in den Topf passt, kann man es auch bereits vor dem Kochen zerteilen. In einem sehr großen Topf Suppenhuhn und die Gewürze hineingeben. Mit kaltem Wasser aufgießen, bis das Suppenhuhn zur Gänze bedeckt ist. Mit Salz würzen und die Suppe aufkochen lassen. Nun ca. 4 Stunden bei geringer Hitze köcheln bzw. ziehen lassen. Wichtig ist dabei, den Deckel leicht auf den Suppentopf zu setzen, damit die Flüssigkeit nicht verdampft. Immer wieder das Fett abschöpfen, damit die Suppe nicht trüb wird. Ungefähr 20 Minuten vor Ende der Garzeit Gemüse und Petersilie hinzufügen. Nachdem die Suppe fertig ist, das Suppenhuhn herausnehmen und das Fleisch herauslösen. In mundgerechte Stücke schneiden. Die Suppe durch ein Sieb abgießen und in einem anderen Topf wieder auffangen. Das Suppengemüse in kleine Würfel schneiden. Nun einen Teil des Hühnerfleischs und der Gemüsewürfel in einen Teller geben und mit der heißen Hühnersuppe aufgießen. Mit Einlagen nach Belieben servieren."
    }
  ],
  "salad": 
  [
    {
      "id": 1,
      "Title": "Griechischer Salat",
      "Schwierigkeit": "Schwierigkeit: 1",
      "Bewertung": "Bewertung: 5",
      "Zutaten": "Zutaten: 1 Stk kleine Zwiebel, eine Prise Kräutersalz, 4 Stk Oliven, 3 EL Olivenöl, 1 Stk Gurke, 50g Schafkäse, 2 Stk Tomaten",
      "Dauer": "Dauer: ca. 7 Minuten",
      "Beschreibung": "Beschreibung: Tomaten waschen und in Spalten schneiden. Die Salatgurke waschen und in längliche dünne Streifen schneiden. Die Zwiebel in dünne Ringe schneiden und mit geschnittenen Gemüse vermengen. 3 Eßlöffel Olivenöl darüber gießen, danach alles miteinander verrühren und mit Kräutersalz abschmecken. Nun können sie die entkernten Oliven und den zerkleinerten Schafskäse auf den Salat geben."
    },
    {
      "id": 2,
      "Title": "Kartoffelsalat",
      "Schwierigkeit": "Schwierigkeit: 2",
      "Bewertung": "Bewertung: 7",
      "Zutaten": "Zutaten: 400g Kartoffeln(speckig), 100g Zwiebeln (fein gehackt), 1 EL Dijonsenf, 5 EL Maiskeimöl, 120ml Rindsuppe(warm),5 El Hesperidenessig, 1 TL Salz(gesrichen), 2TL Zucker(gestrichen), 80ml Wasser(lauwarm)",
      "Dauer": "Dauer: ca. 75 Minuten",
      "Beschreibung": "Beschreibung: Die Kartoffeln mit Schale in Salzwasser ca. 40 Min. bissfest kochen, abgießen, mit kalten Wasser abschrecken, noch warm schälen und in Scheiben schneiden. Danach die Zwiebel schälen, fein hacken und zu den Kartoffelscheiben geben. Alle Marinade-Zutaten in einer Schale gut verrühren und über die noch lauwarmen Kartoffeln gießen und ca. 30 Minuten ziehen lassen."
    },
    {
      "id": 3,
      "Title": "Vitalsalat",
      "Schwierigkeit": "Schwierigkeit: 2",
      "Bewertung": "Bewertung: 6",
      "Zutaten": "Zutaten: 1 Dose Mais, 6 Stk Cocktailtomaten, 1 Stk Endiviensalat, 2 Stk Karotte, 1 Stk Salatgurke, 1 kg Putenfleisch, 1 EL Paprikapulver, 2 Schuss Olivenöl, 4 EL Joghurt, 1 TL Senf, 2 EL Balsamico",
      "Dauer": "Dauer: ca. 50 Minuten",
      "Beschreibung": "Beschreibung: Den Salat waschen und zerpflücken. Die Karotte in feine Streifen raspeln, die Salatgurke in Scheiben schneiden. Die Tomaten vierteln und den Mais aus der Dose nehmen und kalt abbrausen. Die Dressing aus Joghurt, Olivenöl, Senf und Balsamico in einer Schüssel verrühren und durchziehen lassen. (ca. 20-30 Min.)Währenddessen das Fleisch in Streifen schneiden, salzen und pfeffern sowie mit einer Prise rotem Paprikapulver würzen. Das Olivenöl in einer Pfanne heiß werden lassen und das Fleisch darin einige Minuten braten.Die Salatblätter auf Tellern anrichten, das fertig geschnittene Gemüse drauf geben und die Dressing darüber gießen. Nur noch das Fleisch auf den Salat legen und mit Weißbrot servieren."
    }
  ],
  "vegetarian": 
  [
    {
      "id": 1,
      "Title": "Eierspeise",
      "Schwierigkeit": "Schwierigkeit: 1",
      "Bewertung": "Bewertung: 5",
      "Zutaten": "Zutaten: Eier, Salz, Pfeffer, Butter",
      "Dauer": "Dauer: ca. 4 Minuten",
      "Beschreibung": "Beschreibung: Man nehme die Butter und lässt sie in der Pfanne schmelzen. Danach schlagen Sie die Eier in die Pfanne und rührt sie mit einer Gabel solange bis sie fest sind. Als nächstes geben Sie die fast fertige Speise auf einen Teller und würzen Sie nach Belieben."
    },
    {
      "id": 2,
      "Title": "Semmelknödel",
      "Schwierigkeit": "Schwierigkeit: 2",
      "Bewertung": "Bewertung: 7.5",
      "Zutaten": "Zutaten: 300g Semmelwürfel, 100g Mehl, 220ml Milch, 1 Prise Salz, 1 Stk Suppenwürfel, 1 Stk Ei, 3 EL Petersillie, 1 Prise Muskat",
      "Dauer": "Dauer: ca. 35 Minuten",
      "Beschreibung": "Für die Semmelknödel zuerst die Semmelwürfel in eine Schüssel geben. Dann die restlichen Zutaten wie Ei, Mehl, Muskat, Salz, Suppenwürfel, Milch hinzufügen. Zum Schluß gehackten Petersilie unterrühren. Diese Masse gur verrühren und für ca. 10 Minuten rasten lassen. Mit dieser Masse beliebig große Knödel formen, dabei öfter die Hände feucht machen, damit die Knödelmasse nicht klebt. In einem großen Topf Salzwasser zum Kochen bringen und die fertig geformten Semmelknödel darin ca. 12-15 Minuten bei kleiner Flamme köcheln lassen."
    }
  ],
  "vegan":
  [
    {
      "id": 1,
      "Title": "Zucchini Sticks",
      "Schwierigkeit": "Schwierigkeit: 2",
      "Bewertung": "Bewertung: 6",
      "Zutaten": "Zutaten: 1 TL getrocknetes Basilikum, 1 Prise Pfeffer, 1 TL Salz, 4 EL Semmelbrösel, 1 Tasse Weizenvollkornmehl, 500 g Zucchini in fingerdicke Stifte geschnitt, 1 EL Öl",
      "Dauer": "Dauer: ca. 20 Minuten",
      "Beschreibung": "Beschreibung: Mehl, Semmelbrösel und Gewürze mischen und mit einer Tasse Wasser zu einem Teig anrühren. Zucchinistifte in den Teig tauchen, in reichlich heißem Öl von allen Seiten goldgelb ausbraten und heiß servieren."
    },
    {
      "id": 2,
      "Title": "Zucchini-Kartoffel-Auflauf",
      "Schwierigkeit": "Schwierigkeit: 2",
      "Bewertung": "Bewertung: 6",
      "Zutaten": "Zutaten: 4 Stk Zucchini, 4 Stk Kartoffeln, 3 Stk Tomaten, 1 Bund Petersillie, 4 Stk Knoblauchzehen, 1 Prise Salz und Pfeffer(nach Geschmack), 1 Prise Koriander, 5 EL Öl",
      "Dauer": "Dauer: ca. 40 Minuten",
      "Beschreibung": "Beschreibung: Die Kartoffeln schälen, in Scheiben schneiden und kurz in kochendem Wasser ankochen. Die Tomaten würfeln und die Zucchini in Scheiben schneiden. In einer feuerfesten Form etwas Öl verteilen. Darin die Kartoffelscheiben, die Tomatenwürfel und die Zucchinischeiben schichten. Jede Schicht mit Salz, Pfeffer, Knoblauch, Koriander und Petersillie würzen. Auf die oberste Schicht etwas Öl geben. Mit Alufolie oder einem Deckel abdecken und bei 200°C im Backofen etwa 30 Minuten garen."
    }
  ],
  "meat":
  [
    {
      "id": 1,
      "Title": "Schweinemedaillons",
      "Schwierigkeit": "Schwierigkeit: 3",
      "Bewertung": "Bewertung: 7.5",
      "Zutaten": "Zutaten: 500 g Schweinefilet, 2 EL Öl, 1 EL Butter",
      "Dauer": "Dauer: ca. 15 Minuten",
      "Beschreibung": "Beschreibung: Für die Schweinemedaillons zuerst die Schweinefilets waschen, trocken tupfen und Sehnen vom Fleisch entfernen. Vom ganzen Stück 2-3 cm dicke Scheiben schneiden und mit dem Fleischklopfer leicht klopfen - oder mit den Handballen flach drücken. Die Fleischstücke auf allen Seiten mit Salz und Pfeffer gut würzen. Nun eine Servierplatte (oder auch Backblech) im Ofen vorwärmen - ca. 170 Grad (Umluft). In einer beschichteten Pfanne das Öl oder Butterschmalz erhitzen und die Filets von beiden Seite ca. 2 Min. scharf anbraten - nicht zu lange da die Filets sonst zu trocken werden. Die angebratenen Fleischstück aus der Pfanne nehmen in Alufolie einwickeln und in den vorgewärmten Backofen geben und für ca. 15-20 Minuten fertiggaren."
    },
    {
      "id": 2,
      "Title": "Yakitori Spieße",
      "Schwierigkeit": "Schwierigkeit: 3",
      "Bewertung": "Bewertung: 9",
      "Zutaten": "Zutaten: 750 g Hühnerbrustfilets, 200 ml Mirin, 10 ml Sojasoße, 100ml Sake, 2 EL Zucker, 1 EL Öl, 1 Stk Chilischote(getrocknet), 0,5 TL Salz, 1 Prise Pfeffer",
      "Dauer": "Dauer: ca. 40 Minuten",
      "Beschreibung": "Beschreibung: Zuerst zwölf Schaschlickspieße aus Holz in Wasser einweichen (damit sie beim Braten nicht verbrennen). Hähnchenbrustfilet waschen, mit Küchenpapier trockentupfen und in circa 2 cm große Würfel schneiden. Salzen und pfeffern und die Würfel auf die Spieße stecken. Danach Sojasauce, Mirin, Sake Zucker und Chilischoten in einem Topf aufkochen und alles 10 Minuten köcheln lassen, anschließend die Schote herausnehmen. Nun in einer beschichtete Grillpfanne Öl erhitzen, die Spieße circa je 3 Minuten beidseitig grillen. Danach die Spieße mit etwas Sauce bepinseln und noch circa 1 Minute weiter grillen, wieder mit Sauce bepinseln und mit dem Saucenrest servieren."
    }
  ],
  "dessert":
  [
    {
      "id": 1,
      "Title": "Omas Apfelkompott",
      "Schwierigkeit": "Schwierigkeit: 1",
      "Bewertung": "Bewertung: 8",
      "Zutaten": "Zutaten: 450g Äpfel, 150ml Wasser, 4TL Zucker, 1 Prise wZimt",
      "Dauer": "Dauer: ca.  Minuten",
      "Beschreibung": "Beschreibung: Die Äpfel mit einem Sparschäler schälen, in Viertel schneiden und das Kerngehäuse mit einem Messer herausschneiden. In einem Topf das Wasser zusammen mit den Apfelstücken und dem Zucker zum Kochen bringen. Die Hitze reduzieren und die Äpfel zugedeckt 10 Minuten köcheln lassen. Danach gegebenenfalls einzelne größere Apfelstücke mit Hilfe einer Gabe zerdrücken. Vor dem Servieren das Apfelkompott nochmals mit Zucker und einer Prise Zimt abschmecken."
    },
    {
      "id": 1,
      "Title": "Waffeln",
      "Schwierigkeit": "Schwierigkeit: 2",
      "Bewertung": "Bewertung: 9",
      "Zutaten": "Zutaten: 250 g Mehl, 3 Stk Eier, 1 Pk Vanillezucker, 150 g Zucker, 150 ml Milch, 125 g zerlassene Margarine, 1 Prise Salz, 0.5 Pk Backpulver, 0.5 EL Speisestärke",
      "Dauer": "Dauer: ca. 20 Minuten",
      "Beschreibung": "Beschreibung: Für dieses einfache Waffelrezept wird zuerst das Waffeleisen vorgeheizt. In einer Schüssel das Mehl mit dem Backpulver vermischen. Die Eier in einer anderen Schüssel mit dem Mixer schön schaumig schlagen und nach und nach die weiteren Zutaten wie Zucker, Milch, Vanillezucker, Mehl-, Backpulvergemisch und eine Prise Salz einrühren. Die Magarine oder Butter zerlassen und in den Waffelteig geben - nochmal alles gut durchrühren. Nun das heiße Waffeleisen mit Öl oder Butter einfetten - am besten eignet sich dazu ein Pinsel. Jetzt kann der Teig mit Hilfe eines Suppenschöpfers in das Waffeleisen eingefüllt und köstliche, goldgelbe Waffeln gebacken werden. Die fertigen noch warmen Waffeln mit Staubzucker bestreuen und mit Schlagobers und einer Erdbeersauce servieren."
    }
  ],
  "smoothie":
  [
    {
      "id": 1,
      "Title": "Summer Mint",
      "Schwierigkeit": "Schwierigkeit: 3",
      "Bewertung": "Bewertung: 10",
      "Zutaten": "Zutaten: 250 ml Buttermilch, 1 Stk Nektarine, 2 Stk Marille, 1 zw Pfefferminze, 1 EL Preiselbeerkompott",
      "Dauer": "Dauer: ca. 5 Minuten",
      "Beschreibung": "Beschreibung: Buttermilch in einen hohen Mixbecher geben. Von der Pfefferminze zwei Blättchen abzupfen, grob schneiden und zur Buttermilch geben. Nektarine entkernen, schälen und würfelig schneiden. Marillen entkernen und ebenfalls Würfel schneiden. Früchte und Preiselbeerkompott zur Buttermilch geben, alles mit dem Stabmixer ordentlich durchmixen.In Gläser füllen und mit Pfefferminze dekoriert servieren."
    },
    {
      "id": 2,
      "Title": "Strawberry Kiss",
      "Schwierigkeit": "Schwierigkeit: ",
      "Bewertung": "Bewertung: 8",
      "Zutaten": "Zutaten: 1 cl Schalgobers, 2 cl Erdbeersirup, 4 cl Orangensaft , 2 cl Zitronensaft, 5 cl Ananassaft, 200g Erdbeeren",
      "Dauer": "Dauer: ca. 5 Minuten",
      "Beschreibung": "Beschreibung: Erdbeeren waschen, größere Stücke eventuell halbieren. Mit dem Crushed Ice in den Blender (Mixer) geben. Die weiteren Zutaten zufügen. Es Sollte sehr cremig werden. In ein beliebiges Glas frisches Crushed Ice geben und behutsam den Erdbeersirup eingießen. Nun nur noch den kalten, cremigen Erdbeermix ins Glas gießen. Mit einer Erdbeere am Glasrand garnieren."
    }
  ]
}